In [452]:
import pandas as pd
import numpy as np

In [453]:
obj = pd.Series([-7, -5, 7, 4, 2, 0, 4])

In [454]:
obj

0   -7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [455]:
obj.rank(
    method="dense",
)

0    1.0
1    2.0
2    6.0
3    5.0
4    4.0
5    3.0
6    5.0
dtype: float64

In [456]:
obj.rank(method="first")

0    1.0
1    2.0
2    7.0
3    5.0
4    4.0
5    3.0
6    6.0
dtype: float64

In [457]:
frame = pd.DataFrame(
    {"b":[4.3, 7, -3, 2],
     "a":[0, 1, 0, 1],
     "c":[-2, 5, 8, -2.5]}
)

In [458]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [459]:
frame.rank(axis="columns",
           method="max",
           
          )

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [460]:
obj = pd.Series(np.arange(5),
                index=['a', 'a', 'b', 'b', 'c'])

In [461]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [462]:
obj.index.is_unique

False

In [463]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=['a', 'a', 'b', 'b', 'c'])

In [464]:
df

          0         1         2
a  0.581027  0.835437 -0.779209
a -0.462687  0.886132  2.008212
b -1.706700 -0.525487 -0.687072
b -0.998438 -1.298328  0.580244
c  0.364857  1.186098  0.621112

In [465]:
df.loc["a"]

          0         1         2
a  0.581027  0.835437 -0.779209
a -0.462687  0.886132  2.008212

In [466]:
df.loc["c"]

0    0.364857
1    1.186098
2    0.621112
Name: c, dtype: float64

In [467]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])

In [468]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [469]:
df.sum(axis=0)

one    9.25
two   -5.80
dtype: float64

In [470]:
df.sum(axis="index",
       # skipna=False,
      )

one    9.25
two   -5.80
dtype: float64

In [471]:
df.sum(axis=1,
       # skipna=False,
      )

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [472]:
df.idxmax()

one    b
two    d
dtype: object

In [473]:
df.describe().loc['mean']

one    3.083333
two   -2.900000
Name: mean, dtype: float64

In [474]:
# non-numeric data
obj = pd.Series(['a', 'a', 'b', 'c']*4)

In [475]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [476]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [477]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [478]:
pd.Series(obj).value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [479]:
data = pd.DataFrame({"qu1": [1, 3, 4, 3, 4],
                     "qu2": [2, 3, 1, 2, 3],
                     "qu3": [1, 5, 2, 4, 4]})

In [480]:
data.qu1.value_counts().sort_index()

qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [481]:
data.value_counts()

qu1  qu2  qu3
1    2    1      1
3    2    4      1
     3    5      1
4    1    2      1
     3    4      1
Name: count, dtype: int64

In [482]:
import sys

In [483]:
data.to_csv(sys.stdout, index=False, columns=['qu1', 'qu3'], sep="|")

qu1|qu3
1|1
3|5
4|2
3|4
4|4

In [484]:
import sqlite3

In [485]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER);"""

In [486]:
con = sqlite3.connect("mydata.sqlite")
con.execute(query)
con.commit()

OperationalError: table test already exists

In [ ]:
data = [("Atlanta", "Georgia", 1.25, 6),
        ("Tallahassee", "Florida", 2.6, 3),
        ("Sacramento", "California", 1.7, 5)]

In [ ]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [ ]:
cursor = con.execute("SELECT * FROM test")
rows = cursor.fetchall()

In [ ]:
rows

In [ ]:
cursor.description

In [487]:
df = pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

In [488]:
df

              a           b     c  d
0       Atlanta     Georgia  1.25  6
1   Tallahassee     Florida  2.60  3
2    Sacramento  California  1.70  5
3       Atlanta     Georgia  1.25  6
4   Tallahassee     Florida  2.60  3
5    Sacramento  California  1.70  5
6       Atlanta     Georgia  1.25  6
7   Tallahassee     Florida  2.60  3
8    Sacramento  California  1.70  5
9       Atlanta     Georgia  1.25  6
10  Tallahassee     Florida  2.60  3
11   Sacramento  California  1.70  5
12      Atlanta     Georgia  1.25  6
13  Tallahassee     Florida  2.60  3
14   Sacramento  California  1.70  5

In [489]:
import sqlalchemy as sqla

In [490]:
db = sqla.create_engine("sqlite:///mydata.sqlite")

In [491]:
df = pd.read_sql("SELECT * FROM test", db)

In [492]:
df

              a           b     c  d
0       Atlanta     Georgia  1.25  6
1   Tallahassee     Florida  2.60  3
2    Sacramento  California  1.70  5
3       Atlanta     Georgia  1.25  6
4   Tallahassee     Florida  2.60  3
5    Sacramento  California  1.70  5
6       Atlanta     Georgia  1.25  6
7   Tallahassee     Florida  2.60  3
8    Sacramento  California  1.70  5
9       Atlanta     Georgia  1.25  6
10  Tallahassee     Florida  2.60  3
11   Sacramento  California  1.70  5
12      Atlanta     Georgia  1.25  6
13  Tallahassee     Florida  2.60  3
14   Sacramento  California  1.70  5

In [493]:
# drop duplicates
data = pd.DataFrame({"k1": ["one", "two"]*3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})

In [494]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [495]:
# data.duplicated()

In [496]:
# data = data.drop_duplicates()

In [497]:
# data

In [498]:
data.loc[:,'v1'] = range(7)

In [499]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [500]:
data.drop_duplicates(subset=['k2'])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [501]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon", "pastrami", "corned beef", "bacon", "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [502]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [503]:
meat_to_animal = {
    "bacon": "pig",
    "pulled pork": "pig",
    "pastrami": "cow",
    "corned beef": "cow",
    "honey ham": "pig",
    "nova lox" : "Salmon"
}

In [504]:
data['animal'] = data["food"].map(meat_to_animal)

In [505]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  Salmon

In [506]:
data = pd.Series([1., -999., 2.0, -999.0, -1000, -1000, 3])

In [507]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5   -1000.0
6       3.0
dtype: float64

In [508]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    NaN
6    3.0
dtype: float64

In [509]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    0.0
6    3.0
dtype: float64

In [510]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    0.0
6    3.0
dtype: float64

In [511]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5   -1000.0
6       3.0
dtype: float64

In [512]:
# binning and discretization
ages = [18, 22, 25, 26, 21, 23, 37, 31, 61, 45, 41, 32]

In [513]:
bins = [18, 25, 35, 60, 100]
# bins = 5

In [514]:
age_categories = pd.cut(ages, bins)

In [515]:
age_categories

[NaN, (18.0, 25.0], (18.0, 25.0], (25.0, 35.0], (18.0, 25.0], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [516]:
ages

[18, 22, 25, 26, 21, 23, 37, 31, 61, 45, 41, 32]

In [517]:
df = pd.DataFrame([[1, 2.12], [3.356, 4.567]])

In [518]:
df

       0      1
0  1.000  2.120
1  3.356  4.567

In [519]:
df_copy = df.copy()

In [520]:
df_copy.iloc[0,0] = pd.NA

In [521]:
df_copy

       0      1
0    NaN  2.120
1  3.356  4.567

In [522]:
df_copy.map(lambda x: len(str(x)), na_action=None)

   0  1
0  3  4
1  5  5

In [523]:
df

       0      1
0  1.000  2.120
1  3.356  4.567

In [524]:
df.map(round, ndigits=1)

     0    1
0  1.0  2.1
1  3.4  4.6

In [525]:
data = pd.DataFrame(np.arange(12).reshape(3, 4),
                    index=['Computer Engineering', 'Civil Engineering', 'Electrical Engineering'],
                    columns=['Year One', 'Year Two', 'Year Three', 'Year Four']
                   )

In [526]:
data

                        Year One  Year Two  Year Three  Year Four
Computer Engineering           0         1           2          3
Civil Engineering              4         5           6          7
Electrical Engineering         8         9          10         11

In [527]:
def transform(x):
    return x[:4].upper()

In [528]:
data.index = data.index.map(transform)

In [529]:
data

      Year One  Year Two  Year Three  Year Four
COMP         0         1           2          3
CIVI         4         5           6          7
ELEC         8         9          10         11

In [530]:
data = data.rename(index=str.title,
                   columns=str.upper,
                  )

In [531]:
data

      YEAR ONE  YEAR TWO  YEAR THREE  YEAR FOUR
Comp         0         1           2          3
Civi         4         5           6          7
Elec         8         9          10         11

In [532]:
pd.cut(np.array([1, 7, 5, 4, 6, 3]), 3,
      right=False,
      )

[[1.0, 3.0), [5.0, 7.006), [5.0, 7.006), [3.0, 5.0), [5.0, 7.006), [3.0, 5.0)]
Categories (3, interval[float64, left]): [[1.0, 3.0) < [3.0, 5.0) < [5.0, 7.006)]

In [533]:
# Binning with qcut
data = np.random.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision=2)

In [534]:
quartiles

[(-0.64, -0.02], (-0.64, -0.02], (0.65, 3.25], (-2.8299999999999996, -0.64], (0.65, 3.25], ..., (-0.02, 0.65], (0.65, 3.25], (-2.8299999999999996, -0.64], (-0.02, 0.65], (-0.64, -0.02]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.8299999999999996, -0.64] < (-0.64, -0.02] < (-0.02, 0.65] < (0.65, 3.25]]

In [535]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))

In [536]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.012689    -0.014993     0.029276    -0.006842
std       1.008831     0.949124     0.976319     1.038053
min      -3.249925    -2.895515    -2.706891    -3.723639
25%      -0.686384    -0.661552    -0.625256    -0.728697
50%      -0.064529    -0.004199     0.041600     0.056764
75%       0.615128     0.620264     0.698506     0.706155
max       3.118590     2.870581     3.443493     2.806601

In [537]:
# Getting outliers where value is greater than three in any column
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
137  0.275767 -0.949049  3.169946  0.200158
157  1.072174 -0.094876 -1.106227 -3.109396
255 -0.223255 -1.251726  3.443493 -0.393222
341 -3.147553  0.768812  1.295241  0.162545
410 -0.274494 -0.327434  1.932984 -3.082044
501  3.118590 -1.146793 -1.124051 -0.645658
524  0.169906  0.434618  3.255561  0.373914
558  3.100392 -1.173576 -0.371188 -0.528243
616 -0.204620 -0.283664 -1.154134 -3.276741
832 -3.203841 -0.969946 -0.556570 -0.518891
900  0.822532  0.329254 -0.391305 -3.723639
915  0.032523  0.445551 -0.577505 -3.138926
962 -3.249925  0.101729 -1.510195  1.229651

In [538]:
# Capping the outlier values to 3
data[data.abs() > 3] = np.sign(data) * 3

In [539]:
data[(data.abs() == 3).any(axis="columns")]

            0         1         2         3
137  0.275767 -0.949049  3.000000  0.200158
157  1.072174 -0.094876 -1.106227 -3.000000
255 -0.223255 -1.251726  3.000000 -0.393222
341 -3.000000  0.768812  1.295241  0.162545
410 -0.274494 -0.327434  1.932984 -3.000000
501  3.000000 -1.146793 -1.124051 -0.645658
524  0.169906  0.434618  3.000000  0.373914
558  3.000000 -1.173576 -0.371188 -0.528243
616 -0.204620 -0.283664 -1.154134 -3.000000
832 -3.000000 -0.969946 -0.556570 -0.518891
900  0.822532  0.329254 -0.391305 -3.000000
915  0.032523  0.445551 -0.577505 -3.000000
962 -3.000000  0.101729 -1.510195  1.229651

In [540]:
# Permutations
df = pd.DataFrame(np.arange(5*7).reshape((5, 7)))

In [541]:
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [542]:
sampler = np.random.permutation(5)

In [543]:
sampler

array([3, 0, 2, 4, 1])

In [544]:
# Sampling
df.take(sampler)

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13

In [545]:
df = pd.DataFrame({"key": ['b', 'b', 'a', 'c', 'a', 'b'],
                   "data1": range(6)})

In [546]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [547]:
pd.get_dummies(df["key"])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [548]:
s = pd.Series(list('abca'))

In [549]:
s

0    a
1    b
2    c
3    a
dtype: object

In [550]:
pd.get_dummies(s)

       a      b      c
0   True  False  False
1  False   True  False
2  False  False   True
3   True  False  False

In [551]:
s1 = ['a', 'b', np.nan]

In [552]:
pd.get_dummies(s1)

       a      b
0   True  False
1  False   True
2  False  False

In [553]:
pd.get_dummies(s1,
               dummy_na=True,
              prefix="key",
              prefix_sep = "-",
              )

   key-a  key-b  key-nan
0   True  False    False
1  False   True    False
2  False  False     True

In [554]:
s1 = pd.Series(["a|b", "a", "a|c"])

In [555]:
s1

0    a|b
1      a
2    a|c
dtype: object

In [556]:
s1.str.get_dummies()

   a  b  c
0  1  1  0
1  1  0  0
2  1  0  1

In [557]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())

In [558]:
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [559]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [560]:
s.dtype

Int64Dtype()

In [561]:
s[3]

In [562]:
s[3] is pd.NA

True

In [563]:
s = pd.Series(["one", "two", None, "three'"], dtype=pd.StringDtype())

In [564]:
s

0       one
1       two
2      <NA>
3    three'
dtype: string

In [565]:
df = pd.DataFrame({"A": [1, 2, None, 4],
                   "B": ["one", "two", "three", None],
                   "C": [False, None, False, True]})

In [566]:
df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [567]:
df['A'] = df['A'].astype("Int64")
df['B'] = df['B'].astype("string")
df["C"] = df["C"].astype("boolean")

In [568]:
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

In [569]:
import re

In [570]:
text = "foo bar\t baz \tqux"

In [571]:
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [572]:
regex = re.compile(r"\s+")

In [573]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [574]:
regex.findall(text)

[' ', '\t ', ' \t']

In [575]:
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

In [576]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""

In [577]:
text

'Dave dave@google.com\nSteve steve@gmail.com\nRob rob@gmail.com\nRyan ryan@yahoo.com'

In [578]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [580]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [581]:
m = regex.search(text)

In [583]:
m

In [584]:
m.start()

5

In [586]:
m.end()

20

In [587]:
text[m.start():m.end()]

'dave@google.com'